app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Home Economics"], ["room_number", 102]]
---
    def create
        @school_class = SchoolClass.new(school_class_params(:title, :room_number))
        @school_class.save

UPDATE "school_classes" SET "room_number" = ? WHERE "school_classes"."id" = ?  [["room_number", 105], ["id", 2]]
---
    def update
        find_school_class
        @school_class.update(school_class_params(:title, :room_number))

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def find_school_class
        @school_class = SchoolClass.find_by(id: params[:id])