app/controllers/students_controller.rb

    def update
        find_student
        @student.update(student_params(:first_name, :last_name))
---
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Margaery"], ["updated_at", "2020-11-04 00:47:23.700439"], ["id", 5]]

    def find_student
        @student = Student.find_by(id: params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]